Tekla Open API Reference for Tekla Structures 2025
IntList.Add Method
 Adds a new integer to the end of the string list.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int Add(
	int value
)
Public Function Add (
	value As Integer
) As Integer
Parameters
value
Type: System.Int32
The integer to be added to the list.
Return Value
Type: Int32
The index where the integer was added.
See Also
Reference
IntList Class
Tekla.Structures.Drawing Namespace